{
  "PIXEL Play – Born Digital Credit Card for The Born Digital": [
    "Welcome to the first all-digital credit card experience with PIXEL Play - A card that allows you to customize benefits to fit your lifestyle.",
    "Seamless Digital Onboarding - Experience a seamless digital onboarding via PayZapp and receive an instant digital credit card.",
    "Customize your card - Select merchants of your choice to earn cashback, choose card design, and select your preferred billing cycle date.",
    "All in One-App - Digitally manage your PIXEL Play credit card from PayZapp. Access features such as Card Controls, Rewards, EMI Dashboard, Statements, Repayments, Recent Transactions, Disputes, Hotlisting, Help Center, Notifications, and much more",
    "Steps to set UPI PIN on PayZapp for Pixel RuPay Credit Card:Login to PayZapp -> View Pixel Home -> Settings -> Pixel Play RuPay Card -> Reset RuPay UPI PIN -> Verify OTP -> Set UPI PIN",
    "Seamless Digital Onboarding - Experience a seamless digital onboarding via PayZapp and receive an instant digital credit card.",
    "Customize your card - Select merchants of your choice to earn cashback, choose card design, and select your preferred billing cycle date.",
    "All in One-App - Digitally manage your PIXEL Play credit card from PayZapp. Access features such as Card Controls, Rewards, EMI Dashboard, Statements, Repayments, Recent Transactions, Disputes, Hotlisting, Help Center, Notifications, and much more",
    {
      "title": "Steps to set UPI PIN on PayZapp for Pixel RuPay Credit Card:",
      "items": [
        "Login to PayZapp -> View Pixel Home -> Settings -> Pixel Play RuPay Card -> Reset RuPay UPI PIN -> Verify OTP -> Set UPI PIN"
      ]
    }
  ],
  "Category": [
    "Cashback"
  ],
  "Rewards": [
    {
      "title": "5% Cashback on choice of any two packs:",
      "items": [
        "Dining & Entertainment Category - BookMyShow & Zomato",
        "Travel Category - MakeMyTrip & Uber",
        "Grocery Category - Blinkit & Reliance Smart Bazaar",
        "Electronics Category - Croma & Reliance Digital",
        "Fashion Category - Nykaa & Myntra"
      ]
    },
    "5% Cashback on Smartbuy",
    {
      "title": "3% Cashback on choice of any one E-commerce merchant:",
      "items": [
        "Amazon or Flipkart or PayZapp"
      ]
    },
    "1% Unlimited Cashback across all other spends",
    "1% Cashback on UPI Spends (Applicable only on PIXEL RuPay Credit Card holders)"
  ],
  "Pay in Parts": [
    "Enjoy hassle-free, one-click instant conversion of the PIXEL Play credit card outstanding balance* to EMIs from your PayZapp.",
    "EMI Dashboard: Manage all your live EMIs within the EMI dashboard from PayZapp.",
    "Flexibility: Choose low-cost and flexible tenures that suit best for your choice of repayment. You can choose between select transactions or outstanding balances*.",
    "100% Digital: No documentation, email, or calling required. Simply convert to EMI and manage EMI repayments fully from your Payzapp.",
    "EMI Dashboard: Manage all your live EMIs within the EMI dashboard from PayZapp.",
    "Flexibility: Choose low-cost and flexible tenures that suit best for your choice of repayment. You can choose between select transactions or outstanding balances*.",
    "100% Digital: No documentation, email, or calling required. Simply convert to EMI and manage EMI repayments fully from your Payzapp."
  ],
  "Additional Features": [
    "In the unfortunate event of losing your PIXEL Play Credit Card, on reporting it immediately to our 24-hour call centre, you have zero liability on any fraudulent transactions made on your Credit Card.",
    "Up to 50 days of interest free period on your PIXEL Play Credit Card from the date of purchase (subject to the submission of the charge by the Merchant)",
    "Available at a nominal interest rate on your PIXEL Play Credit Card. Please refer to Fees and Charges section to .",
    "Flat 10% Savings for HDFC Bank PIXEL Credit card payments via Swiggy Dineout."
  ],
  "PIXEL CashPoints": [
    "Cashback will be credited in the form of PIXEL CashPoints and can be easily managed under the rewards section of the PIXEL Homepage in Payzapp.",
    "Upon the accumulation of 1000 PIXEL CashPoints, they can be redeemed easily to the PayZapp Wallet and used to purchase your choice of brand vouchers within PayZapp digitally.",
    "PIXEL CashPoints are valid for 2 years from the date of accumulation."
  ],
  "How to Apply?": [
    "You can easily apply for the PIXEL Play Credit Card by following the steps below:",
    {
      "step": "Step 1",
      "description": "Download or update the PayZapp app from the Google Play Store for Android or the App Store for iOS"
    },
    {
      "step": "Step 2",
      "description": "Click on the Apply Now for PIXEL Play banner on the PayZapp homepage.Note:A. Upon approval of your PIXEL Credit Card, please complete the card setup process in PayZapp to ensure timely delivery. This step is compulsory and includes choosing your card design (POP, LIT, or ICE), choosing your offer pack (5% or 3% cashback) choice of brands, and the billing cycle date.B. In case you do not select the credit card design within 3 days of approval, you\"ll be issued a digital RuPay card, while the bank will dispatch a default VISA network credit card with the ICE design to your registered postal address as part of the standard issuance process.C. Customers applying for PIXEL Credit Card via PayZapp will get the option to choose network(Visa/RuPay/Both). This option will be available up to 3 days from the day of card application approval, post that, you\"ll be issued with both RuPay & Visa network cards with RuPay as a Digital Card and Visa as a physical plastic card to your registered postal address with ICE colour card design as a standard issuance process. Please note a single consolidated PIXEL statement will be generated for both the cards together every month."
    }
  ],
  "How to activate your PIXEL Card?": [
    "(Note: Customers applying for PIXEL Credit Card via PayZapp will get the option to choose network(Visa/RuPay/Both). This option will be available up to 3 days from the day of card application approval, post that, you\"ll be issued with both RuPay & Visa network cards with RuPay as a Digital Card and Visa as a physical plastic card to your registered postal address with ICE colour card design as a standard issuance process. Please note a single consolidated PIXEL statement will be generated for both the cards together every month.)",
    "Download HDFC Bank PayZapp from Google Play or Apple App Store.",
    "Sign up using your mobile number (ensure it matches the one used for your PIXEL Card application)",
    "Look for the in-app nudge or notification on the PayZapp Home Page to access PIXEL Play.",
    "Customize Your Experience by choosing a vibrant card colour - POP, LIT, or ICE and brand offer pack that fits your lifestyle (Dining & Entertainment, Fashion, Electronics, Travel, Grocery, etc.).",
    "Set Preferences & Activate by choosing your billing cycle date.",
    "Confirm your email ID and tap \"Activate & Proceed\".",
    "Done! Your PIXEL Play Card is instantly activated and ready for use."
  ],
  "How to set-up UPI PIN ?": [
    "Set Up Your UPI PIN in a few steps:",
    "Open PayZapp and tap on \"View PIXEL Home\" on the home screen",
    "Navigate to Settings > \"Set RuPay UPI\"",
    "Verify your OTP, set your card PIN, and you\"re all set!"
  ],
  "How to enable Scan&Pay payments?": [
    "Link Your HDFC Bank PIXEL RuPay Credit Card for Scan & Pay:",
    "Open PayZapp and tap the menu bar on the top left corner.",
    "Go to \"UPI Accounts\" under Account Management.",
    "Under Credit Cards, tap \"Add New\" and select HDFC Bank Credit Card.",
    "Enter the last 6 digits of your card and its expiry date, then proceed.",
    "Verify with OTP, enter your credit card PIN, and create your UPI PIN.",
    "Done! Your card is now linked for Scan & Pay transactions."
  ],
  "How to enable Scan&Pay payments for third party apps?": [
    "Enable Scan & Pay on Third-Party Apps in a few steps:",
    "Open the app and go to Payment Methods.",
    "Select \"Add RuPay Credit Card on UPI\", choose HDFC Bank, and continue.",
    "When the \"Add HDFC Bank RuPay Credit Card\" prompt appears, tap Continue.",
    "That\"s it! Your PIXEL RuPay Credit Card is now linked and ready for Scan & Pay transactions."
  ],
  "Fuel Surcharge Waiver": [
    "1% fuel surcharge waiver at all fuel stations across India (on a minimum transaction of ₹400 and a maximum transaction of ₹5,000. Maximum waiver of ₹250 per statement cycle)."
  ],
  "Joining Benefit": [
    "Get a joining fee waiver by spending ₹20,000 within 90 days of issuance"
  ],
  "Renewal Waiver": [
    "Spend ₹1 lakh or more in the preceding 12 months and get renewal membership fee waived off for next year."
  ],
  "Contactless Payment": [
    "Swipe to Pay",
    "PIXEL Play Credit Card lets you make E- commerce transactions effortlessly with - Swipe to Pay. Now make quick and secure online payments without need of one-time password (OTP) sent via SMS.",
    "Tap & Pay",
    "PIXEL Play Credit Card has enabled contactless payments to facilitate fast, convenient and secure payments at retail outlets. Just tap once with either your phone or physical card and make hassle free offline payments.",
    "Scan and Pay",
    "Through the PIXEL RuPay credit card, customers will be able to make payment to a merchant by scanning the QR code for unified Payment Interface (UPI) Payments."
  ],
  "Statement & Repayments": [
    "You can easily view and download the digital statements in the PayZapp.",
    "View the current outstanding on the card and make card repayment within the PIXEL Home page using payment methods like UPI, Debit card, & Netbanking."
  ],
  "Servicing via Help Center": [
    "You can easily refer to the FAQs for every section by clicking on “?” in the app screen to view and get answers to your questions.",
    "You can also raise a query ticket within the app if you need more help by clicking “Raise a Ticket”, and the service team will respond to your query in the app.",
    "How to Raise a Ticket?1. Tap \"?\" on the Pixel Play Credit Card Home Page.2. Choose the relevant category and query.3. If your query isn’t listed, select \"My query is not listed\" to raise a ticket."
  ]
}