{
  "id": "02cdd28ec6a4ccee",
  "url": "https://www.hdfcbank.com/personal/pay/cards/credit-cards/pixel-play-credit-card",
  "scraped_at": "2025-08-08T14:28:31.886Z",
  "card": {
    "name": "PIXEL Play Credit Card",
    "bank": "HDFC Bank",
    "variant": "RuPay and Visa",
    "description": "PIXEL Play is a born digital credit card offering a fully digital onboarding experience via PayZapp, allowing cardholders to customize benefits, select merchants for cashback, choose card design, and preferred billing cycle date. It provides seamless digital management of the card through the PayZapp app with features like Card Controls, Rewards, EMI Dashboard, Statements, Repayments, Recent Transactions, Disputes, Hotlisting, Help Center, and Notifications.",
    "target_audience": "Digital-savvy customers who prefer a customizable credit card experience with digital onboarding and management."
  },
  "rewards": {
    "program": "CashPoints",
    "type": "Cashback",
    "earning": {
      "base_rate": 1,
      "categories": [
        {
          "name": "Choice of any two packs (5% Cashback)",
          "rate": 5,
          "cap": 500,
          "description": "5% Cashback on transactions at selected merchants in two chosen packs. Each pack comprises two merchants from categories such as Dining & Entertainment (BookMyShow & Zomato), Travel (MakeMyTrip & Uber), Grocery (Blinkit & Reliance Smart Bazaar), Electronics (Croma & Reliance Digital), and Fashion (Nykaa & Myntra).",
          "terms_and_conditions": "Cashback awarded as CashPoints credited to reward balance in the mobile app. Capping of 500 CashPoints per calendar month per pack. Transactions must be settled and posting date considered for points. Merchants in each pack are fixed and cannot be changed. Cardholder can change selected packs every 3 months. Transactions less than ₹100 do not earn CashPoints. Cashback not applicable on fuel spends, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges. Fractional CashPoints rounded down. Transactions via PayZapp get maximum cashback. Returned or cancelled transactions lead to reversal of CashPoints.",
          "how_to_earn": "Select two packs post card approval via app. Spend at merchants in selected packs to earn 5% cashback capped at 500 CashPoints per pack per month.",
          "validity": "CashPoints calculated on calendar month basis (1st to 30/31st).",
          "exclusions": "Fuel spends, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges."
        },
        {
          "name": "SmartBuy Platform",
          "rate": 5,
          "cap": 500,
          "description": "5% Cashback on successful transactions on SmartBuy platform categories including IGP, Flights, Hotels, Bus, Rail, Instant Vouchers, Apple Imagine Tresor.",
          "terms_and_conditions": "Cashback awarded as CashPoints credited to reward balance in the mobile app. Capping of 500 CashPoints per calendar month. Transactions must be settled. Cashback not applicable on fuel spends, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges.",
          "how_to_earn": "Make purchases on SmartBuy platform in eligible categories to earn 5% cashback capped at 500 CashPoints per month.",
          "validity": "Calendar month basis.",
          "exclusions": "Fuel spends, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges."
        },
        {
          "name": "Choice of any one e-commerce merchant (3% Cashback)",
          "rate": 3,
          "cap": 500,
          "description": "3% Cashback on transactions at one chosen e-commerce platform among Amazon, Flipkart, or PayZapp.",
          "terms_and_conditions": "Cashback awarded as CashPoints credited to reward balance in the mobile app. Capping of 500 CashPoints per calendar month. Transactions must be settled. Cashback not applicable on fuel spends, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges.",
          "how_to_earn": "Select one e-commerce platform post card approval via app. Spend at selected platform to earn 3% cashback capped at 500 CashPoints per month.",
          "validity": "Calendar month basis.",
          "exclusions": "Fuel spends, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges."
        },
        {
          "name": "All other spends",
          "rate": 1,
          "cap": null,
          "description": "1% unlimited cashback on all other eligible spends excluding those specifically excluded.",
          "terms_and_conditions": "CashPoints awarded on eligible spends excluding fuel, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges. No cap on cashback.",
          "how_to_earn": "Use card for all other eligible transactions to earn 1% cashback.",
          "validity": null,
          "exclusions": "Fuel spends, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges."
        },
        {
          "name": "UPI spends (PIXEL RuPay Credit Card only)",
          "rate": 1,
          "cap": 500,
          "description": "1% cashback on UPI spends made using PIXEL RuPay Credit Card, capped at 500 CashPoints per calendar month.",
          "terms_and_conditions": "Applicable only for PIXEL RuPay Credit Card holders. Cashback capped at 500 CashPoints per calendar month. Cashback awarded as CashPoints credited to reward balance in the mobile app. Transactions must be settled. Excludes restricted merchant categories such as P2P, P2PM, digital account opening, lending platforms, cash withdrawal at merchant or ATM, ERUPI, IPO, Foreign Inward Remittances, Mutual Funds, and other categories restricted by HDFC Bank.",
          "how_to_earn": "Make UPI payments using PIXEL RuPay Credit Card to eligible merchants to earn 1% cashback capped at 500 CashPoints per month.",
          "validity": "Calendar month basis.",
          "exclusions": "Restricted merchant categories including P2P, P2PM, digital account opening, lending platforms, cash withdrawal at merchant or ATM, ERUPI, IPO, Foreign Inward Remittances, Mutual Funds, and other categories restricted by HDFC Bank."
        }
      ],
      "bonus_rates": []
    },
    "redemption": [
      {
        "option": "CashPoints redemption",
        "minimum": null,
        "value": null,
        "process": "CashPoints are credited to the cardholder's reward balance in the mobile app and can be redeemed as per HDFC Bank's redemption policies via PayZapp or other designated channels.",
        "terms_and_conditions": "CashPoints are awarded only on eligible transactions as per the cashback scheme. Returned or cancelled transactions lead to reversal of CashPoints. Points are rounded down to the nearest integer. Transactions below ₹100 do not earn points.",
        "validity": null,
        "processing_time": "Points credited once transaction is settled by merchant."
      }
    ]
  },
  "benefits": [
    {
      "category": "Digital Management",
      "name": "Seamless Digital Onboarding and Management",
      "description": "Instant digital credit card issuance via PayZapp with ability to customize card design, select billing cycle date, and manage card features digitally.",
      "how_to_avail": "Apply and onboard via PayZapp app. Customize card and manage all features digitally within the app.",
      "value": null,
      "terms_and_conditions": "Digital card issued instantly upon approval. Physical card issued based on variant held (Visa or RuPay).",
      "validity": null,
      "eligibility": "Available to all approved PIXEL Play Credit Card applicants.",
      "usage_limit": null
    },
    {
      "category": "Card Controls",
      "name": "Card Controls and Security Features",
      "description": "Enable or disable online transactions, set UPI PIN, manage disputes, hotlist card, and access help center via PayZapp app.",
      "how_to_avail": "Use PayZapp app to access card controls and security features.",
      "value": null,
      "terms_and_conditions": "Online transactions must be enabled in card controls for transactions to be successful. UPI PIN must be set for UPI transactions.",
      "validity": null,
      "eligibility": "PIXEL Play Credit Card holders.",
      "usage_limit": null
    },
    {
      "category": "Pay in Parts",
      "name": "Pay in Parts EMI Conversion",
      "description": "Convert outstanding credit card balance to EMIs instantly via PayZapp with flexible tenure and manage EMIs via EMI dashboard.",
      "how_to_avail": "Use PayZapp app to convert outstanding balance to EMI. Minimum amount due must be paid separately. EMI includes principal plus interest and GST on interest.",
      "value": null,
      "terms_and_conditions": "Loan amount blocked against credit limit. Processing fee and GST applicable. Partial pre-payment not allowed; pre-closure allowed with 3% pre-closure charge plus GST. Loan cannot be availed on gold & jewellery transactions. Default in EMI payment may lead to suspension or termination of loan services. Terms subject to change at bank's discretion.",
      "validity": null,
      "eligibility": "PIXEL Play Credit Card holders with outstanding balance.",
      "usage_limit": null
    }
  ],
  "current_offers": [
    {
      "title": "Customizable Cashback Packs",
      "description": "Choose any two merchant packs for 5% cashback and one e-commerce platform for 3% cashback along with 1% cashback on other spends.",
      "validity": "Ongoing",
      "terms_and_conditions": "Cashback capped at 500 CashPoints per pack per calendar month. Merchants in packs are fixed. Cashback not applicable on excluded spends such as fuel, wallet spends, rent, government transactions, EMI, cash advances, fees, and charges. Transactions must be settled to earn cashback. Cashback on UPI spends capped at 500 CashPoints per month for RuPay cardholders.",
      "activation_required": true,
      "how_to_activate": "Select preferred packs and e-commerce platform via PayZapp app post card approval.",
      "eligibility": "PIXEL Play Credit Card holders.",
      "maximum_benefit": "Up to 500 CashPoints per pack per month for 5% cashback, 500 CashPoints per month for 3% cashback, and unlimited 1% cashback on other spends.",
      "offer_code": null,
      "exclusions": "Fuel spends, wallet spends, rent payments, government transactions, EMI transactions, cash advances, payment of outstanding balances, card fees, and other charges."
    }
  ],
  "perks": [
    {
      "name": "Instant Digital Card Issuance",
      "description": "Receive an instant digital credit card upon approval to start using immediately.",
      "category": "Digital Onboarding",
      "usage_limit": null,
      "how_to_use": "Access digital card via PayZapp app immediately after approval.",
      "terms_and_conditions": "Physical card issuance depends on card variant held. Digital card is accessible only via PayZapp.",
      "value": null,
      "validity": null
    },
    {
      "name": "UPI Card Linking and Payments",
      "description": "Link PIXEL RuPay Credit Card to UPI apps like PayZapp, PhonePe, and GPay for UPI payments with cashback.",
      "category": "Payment Convenience",
      "usage_limit": "No limit on number of UPI transactions.",
      "how_to_use": "Set UPI PIN via PayZapp app. Link card in UPI apps by adding credit card and verifying OTP. Use UPI app to scan QR or pay merchants.",
      "terms_and_conditions": "Only PIXEL RuPay Credit Card can be linked to UPI. Payments allowed only to merchants (P2M). Restricted merchant categories excluded. Cashback capped at 500 CashPoints per month.",
      "value": "1% cashback on UPI spends capped at 500 CashPoints per month.",
      "validity": null
    }
  ],
  "partnerships": [
    {
      "partner": "SmartBuy",
      "benefit": "5% Cashback on select categories and up to 10X Reward Points on purchases via SmartBuy platform",
      "category": "Online Shopping and Travel",
      "validity": "Ongoing",
      "how_to_avail": "Make purchases through HDFC Bank SmartBuy platform using PIXEL Play Credit Card.",
      "terms_and_conditions": "Cashback and reward points applicable only on successful transactions in eligible categories. Cashback capped at 500 CashPoints per month for 5% cashback. SmartBuy offers not applicable on non-HDFC Bank payment instruments. HDFC Bank not responsible for merchant products or services. Terms subject to change.",
      "discount_percentage": "Up to 10X Reward Points / 10% Cashback",
      "maximum_discount": null
    },
    {
      "partner": "BookMyShow & Zomato",
      "benefit": "5% Cashback on Dining & Entertainment category",
      "category": "Dining & Entertainment",
      "validity": "Ongoing",
      "how_to_avail": "Select Dining & Entertainment pack and spend at BookMyShow and Zomato using PIXEL Play Credit Card.",
      "terms_and_conditions": "Cashback capped at 500 CashPoints per calendar month. Transactions must be settled. Exclusions apply as per cashback terms.",
      "discount_percentage": "5%",
      "maximum_discount": "500 CashPoints per month"
    },
    {
      "partner": "MakeMyTrip & Uber",
      "benefit": "5% Cashback on Travel category",
      "category": "Travel",
      "validity": "Ongoing",
      "how_to_avail": "Select Travel pack and spend at MakeMyTrip and Uber using PIXEL Play Credit Card.",
      "terms_and_conditions": "Cashback capped at 500 CashPoints per calendar month. Transactions must be settled. Exclusions apply as per cashback terms.",
      "discount_percentage": "5%",
      "maximum_discount": "500 CashPoints per month"
    },
    {
      "partner": "Blinkit & Reliance Smart Bazaar",
      "benefit": "5% Cashback on Grocery category",
      "category": "Grocery",
      "validity": "Ongoing",
      "how_to_avail": "Select Grocery pack and spend at Blinkit and Reliance Smart Bazaar using PIXEL Play Credit Card.",
      "terms_and_conditions": "Cashback capped at 500 CashPoints per calendar month. Transactions must be settled. Exclusions apply as per cashback terms.",
      "discount_percentage": "5%",
      "maximum_discount": "500 CashPoints per month"
    },
    {
      "partner": "Croma & Reliance Digital",
      "benefit": "5% Cashback on Electronics category",
      "category": "Electronics",
      "validity": "Ongoing",
      "how_to_avail": "Select Electronics pack and spend at Croma and Reliance Digital using PIXEL Play Credit Card.",
      "terms_and_conditions": "Cashback capped at 500 CashPoints per calendar month. Transactions must be settled. Exclusions apply as per cashback terms.",
      "discount_percentage": "5%",
      "maximum_discount": "500 CashPoints per month"
    },
    {
      "partner": "Nykaa & Myntra",
      "benefit": "5% Cashback on Fashion category",
      "category": "Fashion",
      "validity": "Ongoing",
      "how_to_avail": "Select Fashion pack and spend at Nykaa and Myntra using PIXEL Play Credit Card.",
      "terms_and_conditions": "Cashback capped at 500 CashPoints per calendar month. Transactions must be settled. Exclusions apply as per cashback terms.",
      "discount_percentage": "5%",
      "maximum_discount": "500 CashPoints per month"
    },
    {
      "partner": "Amazon, Flipkart, PayZapp",
      "benefit": "3% Cashback on one chosen e-commerce platform",
      "category": "E-commerce",
      "validity": "Ongoing",
      "how_to_avail": "Select one e-commerce platform and spend using PIXEL Play Credit Card.",
      "terms_and_conditions": "Cashback capped at 500 CashPoints per calendar month. Transactions must be settled. Exclusions apply as per cashback terms.",
      "discount_percentage": "3%",
      "maximum_discount": "500 CashPoints per month"
    }
  ],
  "fees_and_charges": [
    {
      "type": "Processing Fee for Pay in Parts EMI",
      "amount": "As applicable, levied during immediate billing cycle post loan booking",
      "waiver_conditions": null,
      "frequency": "One-time per EMI conversion",
      "terms_and_conditions": "Processing fee applicable on EMI conversion. GST @18% applicable on interest amount of EMI, processing fee, and pre-closure charges. Partial pre-payment not allowed. Pre-closure charge is 3% of balance principal outstanding plus GST @18%. Charges subject to change at bank's discretion."
    },
    {
      "type": "Pre-closure Charges for Pay in Parts EMI",
      "amount": "3% of balance principal outstanding plus GST @18%",
      "waiver_conditions": null,
      "frequency": "One-time on pre-closure",
      "terms_and_conditions": "Pre-closure charges applicable if loan is closed before tenure completion. Additional interest from last statement date till pre-closure date payable by customer. Charges subject to change."
    }
  ],
  "additional_information": {
    "card_variants": {
      "RuPay": {
        "physical_card": "Physical card issued only for RuPay variant holders.",
        "digital_card": "Digital card accessible via PayZapp app.",
        "UPI_linking": "PIXEL RuPay Credit Card can be linked to UPI apps (PayZapp, PhonePe, GPay) for UPI payments.",
        "UPI_PIN": "UPI PIN must be set via PayZapp app to authenticate UPI transactions.",
        "UPI_cashback_cap": "1% cashback on UPI spends capped at 500 CashPoints per calendar month.",
        "UPI_restrictions": "Payments allowed only to merchants (P2M). Restricted categories include P2P, P2PM, digital account opening, lending platforms, cash withdrawal at merchant or ATM, ERUPI, IPO, Foreign Inward Remittances, Mutual Funds, and other categories restricted by HDFC Bank."
      },
      "Visa": {
        "physical_card": "Physical card issued only for Visa variant holders.",
        "digital_card": "Digital card accessible via PayZapp app.",
        "UPI_linking": "Currently, PIXEL Visa Credit Card cannot be linked to UPI."
      },
      "Dual_holders": {
        "statement": "Single statement issued including transactions on both Visa and RuPay cards.",
        "credit_limit": "Combined credit limit for both Visa and RuPay variants.",
        "billing_date": "Same billing date for both cards."
      }
    },
    "cashback_exclusions": [
      "Fuel spends",
      "Wallet spends (Gift or Prepaid Card load, Voucher purchase)",
      "Rent payments",
      "Government related transactions",
      "EMI transactions",
      "Purchases converted to EMI post facto",
      "Cash advances",
      "Payment of outstanding balances",
      "Payment of card fees and other charges"
    ],
    "cashback_calculation": "CashPoints calculated on transaction amount rounded down to nearest integer. Transactions below ₹100 do not earn CashPoints.",
    "cashback_reversal": "CashPoints reversed if transaction is returned, cancelled, or converted to EMI (Pay in Parts).",
    "transaction_settlement": "CashPoints credited once transaction is settled by merchant.",
    "card_controls": "Online transactions must be enabled via card controls in PayZapp app for transactions to succeed.",
    "dispute_and_hotlisting": "Disputes and hotlisting can be managed digitally via PayZapp app.",
    "loan_on_card_restrictions": "Pay in Parts loan cannot be availed on gold & jewellery transactions; bank reserves right to cancel loan if violated.",
    "loan_preclosure": "Pre-closure allowed with charges; partial pre-payment not allowed.",
    "loan_default": "Default in EMI payment may lead to suspension or termination of loan services.",
    "terms_modification": "Bank reserves right to modify or withdraw offers and terms at its discretion without prior notice.",
    "smartbuy_platform": {
      "description": "SmartBuy is a platform offering deals and cashback on purchases from over 150 partners including flights, hotels, bus, rail, instant vouchers, and more.",
      "terms": "Offers valid only on HDFC Bank payment instruments. Bank not responsible for merchant products or services. Cashback and reward points subject to terms and conditions on SmartBuy platform.",
      "usage": "Access SmartBuy via HDFC Bank website or PayZapp app to avail offers."
    }
  },
  "metadata": {
    "last_updated": "2025-08-08T14:28:31.858Z",
    "confidence_score": 1,
    "missing_data": [],
    "processed_links": 13,
    "failed_links": 0,
    "failed_link_details": []
  }
}